tocache/Microchip-PIC18F4550/UPC Microcontroladores 2019-2/Semana 9/el57_otros.X/newmain3.c
//Este es un comentario
//Bits de configuracion o directivas de preprocesador
#pragma config PLLDIV = 1       // PLL Prescaler Selection bits (No prescale (4 MHz oscillator input drives PLL directly))
#pragma config CPUDIV = OSC1_PLL2// System Clock Postscaler Selection bits ([Primary Oscillator Src: /1][96 MHz PLL Src: /2])
#pragma config FOSC = XTPLL_XT  // Oscillator Selection bits (XT oscillator, PLL enabled (XTPLL))
#pragma config PWRT = ON        // Power-up Timer Enable bit (PWRT enabled)
#pragma config BOR = OFF        // Brown-out Reset Enable bits (Brown-out Reset disabled in hardware and software)
#pragma config BORV = 3         // Brown-out Reset Voltage bits (Minimum setting 2.05V)
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)
#pragma config CCP2MX = ON      // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = OFF     // PORTB A/D Enable bit (PORTB<4:0> pins are configured as digital I/O on Reset)
#pragma config LPT1OSC = OFF    // Low-Power Timer 1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)
#pragma config LVP = OFF        // Single-Supply ICSP Enable bit (Single-Supply ICSP disabled)

#include <xc.h>
#define _XTAL_FREQ 48000000UL   //Frecuencia de trabajo actual

unsigned int retardado(tiempo){
    for(unsigned int i=0; i<tiempo; i++){
        __delay_us(1);
    }
}

void main(void){
    TRISDbits.RD0 = 0;          //RD0 como salida
    TRISDbits.RD1 = 0;          //RD1 como salida
    while(1){
        if(PORTBbits.RB0 == 1){
            for(unsigned int j=0; j<10;j++){
                for(unsigned int k=0;k<30;k++){
                    LATDbits.LD0 = 1;
                    LATDbits.LD1 = 0;
                    retardado(j*100);
                    LATDbits.LD0 = 0;
                    LATDbits.LD1 = 1;
                    retardado(1000-(j*100));
                }
            }
            for(unsigned int j=0; j<10;j++){
                for(unsigned int k=0;k<30;k++){
                    LATDbits.LD0 = 0;
                    LATDbits.LD1 = 1;
                    retardado(j*100);
                    LATDbits.LD0 = 1;
                    LATDbits.LD1 = 0;
                    retardado(1000-(j*100));
                }
            }
        }
        else{
            LATDbits.LD1 = 0;
            LATDbits.LD0 = 0;
        }
    }
}